## Задание 1
Рассматривается множество целых чисел, принадлежащих отрезку [1012; 9638], которые делятся на 7 и оканчиваются на 1. Найдите сумму таких чисел.

```
summa = 0
for i in range(1012, 9639):  # 9638 включительно
    if i % 7 == 0 and i % 10 == 1:
        summa += i
print(f"Сумма: {summa}") 
```
## Для самопроверки: программа должна вывести число 656943.

## Задание 2
Рассматривается множество целых чисел, принадлежащих отрезку [1125; 7856], которые делятся а 3 и не делятся на 7 и 5. Найдите количество таких чисел.

```
print("\nЗадание 2")
count = 0
for i in range(1125, 7857):  # 7856 включительно
    if i % 3 == 0 and i % 7 != 0 and i % 5 != 0:
        count += 1
print(f"Количество: {count}")
```
## Для самопроверки: программа должна вывести число 1538.

## Задание 3
Рассматривается множество целых чисел, принадлежащих отрезку [100; 999], которые являются палиндромом (одинаково читаются как слева направо, так и справа налево). Найдите сумму таких чисел.

```
summa = 0
for i in range(100, 1000):
    s = str(i)
    if s == s[::-1]:
        summa += i
print(f"Сумма палиндромов: {summa}")
```
## Для самопроверки: программа должна вывести число 49500.

## Задание 4
В программу вводится два натуральных числа: N и K. Выведите на экран последовательность, состоящую из N чисел с разностью K (последовательность начинается с единицы)

```
N = int(input("Введите N: "))
K = int(input("Введите K: "))
for i in range(N):
    print(1 + i * K, end=" ")
print()
```
* Пример ввода:
4
2
* Пример вывода:
1 3 5 7 

## Задание 5
В программу вводится одно натуральное число N. Выведите на экран все значения функции f(x) = x*x + 5x - 7 в целых точках на отрезке [0; N].

```
N = int(input("Введите N: "))
for x in range(N + 1):
    print(x * x + 5 * x - 7, end=" ")
print()
```
* Входные данные:
Введите N: 10

* Выходные данные:
-7 -1 7 17 29 43 59 77 97 119 143

## Задание 6
В программу вводится натуральное число N, а затем N натуральных чисел. Требуется найти сумму чисел, которые делятся на 7 и являются трехзначными. В результате программа должна вывести одно число: сумму требуемых чисел.

```
N = int(input("Введите N: "))
summa = 0
for i in range(N):
    num = int(input())
    if num % 7 == 0 and 100 <= num <= 999:
        summa += num
print(f"Сумма: {summa}")
```
* Входные данные:
Введите количество чисел N: 5
Введите число 1: 15
Введите число 2: 749
Введите число 3: 222
Введите число 4: 17
Введите число 5: 651

* Выходные данные:
Сумма требуемых чисел: 1400

## Задание 7
В программу вводится число N, после чего - N натуральных чисел, не превышающих 1000. Программа должна найти и вывести на экран максимальное числократное 7 и не кратное 9.

```
N = int(input("Введите N: "))
max_num = 0
for i in range(N):
    num = int(input())
    if num % 7 == 0 and num % 9 != 0 and num > max_num:
        max_num = num
print(f"Максимальное число: {max_num}")
```
* Входные данные:
Введите количество чисел N: 6
Введите число 1: 42
Введите число 2: 63
Введите число 3: 98
Введите число 4: 77
Введите число 5: 126
Введите число 6: 84

* Выходные данные:
Максимальное число: 98

## Задание 8
В программу вводится число N, после чего - N натуральных чисел, не превышающих 1000. Программа должна найти и вывести на экран минимальное двузначное число, восьмеричная запись которого оканчивается на 3.

```
N = int(input("Введите N: "))
min_num = float('inf')  # Бесконечность для поиска минимума
for i in range(N):
    num = int(input())
    if 10 <= num <= 99 and oct(num)[-1] == '3':
        if num < min_num:
            min_num = num
if min_num != float('inf'):
    print(f"Минимальное число: {min_num}")
else:
    print("Таких чисел нет")
```
* Входные данные:
Введите количество чисел N: 5
Введите число 1: 27
Введите число 2: 35
Введите число 3: 43
Введите число 4: 19
Введите число 5: 51

* Выходные данные:
Минимальное число: 19

## Задание 9
В программу вводится число N. Программа должна вывести два столбца чисел. В первом столбце – числа от 1 до N, во втором – числа от N до 1.

```
N = int(input("Введите N: "))
for i in range(1, N + 1):
    print(i, N - i + 1)
```
* Пример: 8

* Выходные данные:
* 1 2 3 4 5 6 7 8
* 8 7 6 5 4 3 2 1
