# Задание 1
На вход алгоритма подается натуральное число N.Алгоритм строит по нему новое число R следующим образом.
1)Строится двоичная запись числа N.
2)Затем справа дописываются два разряда: символы 01, если число N четное,и 10, если нечетное.
Полученная таким образом запись (в ней два разряда больше, чем в записи исходного числа N) явдяется двоичной записью искомого числа R.
Укажите минимальное число R. больше 130, которое может являться результатом работы этого алгоритма.В ответе это число запишите в десятичной
системе.

### Перебираем все возможные значения N от 1 до 99
```
for n in range(1,100):
```
### Получаем двоичную запись числа
```
r = bin(n)[2:]
```
### Проверяем, является ли N четным
```
if n % 2 == 0:
```
### Если N четное - дописываем справа '01'
```
r += 01
else:
```
### Если N нечетное - дописываем справа '10'
```
r += '10'
```
### Проверяем, превышает ли полученное число R значение 130
```
if int(r,2) > 130:
```
### Выводим первое найденное число (оно будет минимальным)
```
print(int(r,2))
```
### Как выглядит само решение:
```
for n in range(1,100):
    r = bin(n)[2:]
    if n % 2 == 0:
        r += '01'
    else:
        r += '10'
    if int(r,2) > 130:
        print(int(r,2))
