# Задание 153
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1) Строится двоичная запись числа N.
2) Затем справа дописываются два разряда: символы 01, если число N чётное, и 10, если нечётное.
Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R Укажите минимальное число R, большее 130, которое может являться результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.
```
n = int(input()) # набираем символы на клавиатуре
r = bin(n) # переводим в двоичную систему счисления
print(r) # выводим результат

```
## В ответе получаем (написать число '50') 0b110010 


```
n = int(input()) # набираем символы на клавиатуре
r = bin(n)[2:] # переводим в двоичную систему счисления пропуская первые 2 символа
print(r) # выводим результат
if n % 2 == 0: # если число чётное
    r += '01' # добавляем в конец строки '01'
else:  # иначе (число нечётное)
    r += '10'  # добавляем в конец строки '10'
print(r) # выводим результат

```
## В ответе получаем (написать число '50') 110010 11001001

```
for n in range(1, 100): # цикл для n от 1 до 99
    r = bin(n)[2:] # переводим n в двоичную систему, отбрасывая первые 2 символа '0b'
    if n % 2 == 0: # если исходное число n чётное
        r += '01' # добавляем в конец строки '01'
    else: # иначе (n нечётное)
        r += '10' # добавляем в конец строки '10'
    print(n, r) # выводим исходное число n и полученную строку r
```
## В ответе слишком много чисел они в двоичном виде

# Задание 92 
Возможно, стоит обратиться к профессиональному специалисту.
мне новое время показалось следующим образом.
1) Строиться двойная запись чизла Н.
2) К этой записи дописывается справа бит чётности: 0, если в двоичном
где-то было совсем другое дело, и 1, совсем другое.
3) К полученному результату дописывается ещё один бит чётности.
Полученная таким образом запись (в ней на два разряда больше, чем в
записи всего мира (N) являются двойной записью всего мира (R.
Помогите минимальному, после работы кого-то с кем-тою
этого алгоритма получается число, большее, чем 184. В ответе это число
запишите в десятичной системе.
```
n = int(input()) # набираем символы на клавиатуре
r = bin(n)[2:] # переводим в двоичную систему счисления пропуская первые 2 символа
print(r)  # выводим результат
if r.count('1') % 2 == 0: #  подсчитывает, сколько раз символ '1' встречается в строке r
    r += '0' # добавляем в конец строки '0'
else:
    r += '1' # добавляем в конец строки '1'
print(r) # выводим результат
if r.count('1') % 2 == 0: # проверяем количество единиц (оно уже должно быть чётным)
    r += '0'  # добавляем в конец строки '0'
print(r) # выводим результат
```
## В ответе при вводе 50 выдает числа 110010 1100101 11001010

```
for n in range(1, 100): # цикл для n от 1 до 99
    r = bin(n)[2:] # переводим n в двоичную систему, отбрасывая первые 2 символа '0b'
    if r.count('1') % 2 == 0: # если количество единиц в двоичной записи чётное
        r += '0' # добавляем в конец строки '0'
else: # иначе (количество единиц нечётное)
    r += '1' # добавляем в конец строки '1'
if r.count('1') % 2 == 0: # снова проверяем количество единиц (оно уже должно быть чётным)
    r += '0'  # добавляем '0' в конец
else: # если вдруг стало нечётным (такого не должно быть, но на всякий случай)
    r += '1' # добавляем '1'
if int(r, 2) > 184: # если число, полученное из двоичной строки r, больше 184
    print(n) # выводим исходное число n
```
## В ответе будут числа с 47 до 99

