# Задание 92
На вход алгоритма подается натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1) Строится двоичная запись числа N.
2) К этой записи дописывается справа бит четности: 0, если в двоичном коде числа N было четное число единиц, и 1, если нечетное.
3) К полученному результату дописывается еще один бит четности.

Полученная таким образом запись является двоичной записью искомого числа R. Укажите мин. число N, после обработки которого с помощью этого алгоритма получается число, больше, чем 184. В ответе это число запишите в десятичной системе.

```
for n in range(1,100) - переменная по очереди принимает значения от 1 до 99. Для каждого из этих чисел мы будем выполнять набор действий.
```
```
r =bin(n)[2:] - функция bin(n) переводит число n в двоичную строку
```
```
if r.count('1') % 2 == 0: - первая проверка четности
    r += '0'
else:
    r += '1'
```
```
if  r.count('1') % 2 == 0: - вторая проверка четности
     r += '0'
else:
    r += '1'
```
```
if int(r,2) > 184: - проверка условия и вывод
    print(n)
```
# Конечный результат решения
```
for n in range(1,100):
    r = bin(n)[2:]
    if r.count('1') % 2 == 0:
    r += '0'
else:
    r += '1'
 if  r.count('1') % 2 == 0: 
    r += '0'
else:
    r += '1'
if int(r,2) > 184: 
    print(n)
```
 

