# Задания 2 типа

## Задание 2 типа №15814
Логическая функция F задаётся выражением (x ≡ ( w ∨ y)) ∨ ((w  → z ) ∧ (y  → w)). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not((x == (w or y)) or ((w <= z) and (y <= w))):
                    print(x, y, z, w)
```
## Ответ: yxzw

## Задание 2 типа №85678
Миша заполнял таблицу истинности логической функции F ¬w ∨ ((z → x) → y), но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not(not(w) or ((z <= x) <= y)):
                    print(x, y, z, w)
```
## Ответ: yxwz

## Задание 2 типа №85715
Миша заполнял таблицу истинности логической функции F ¬x ∨ ((w → y) → z), но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not(not(x) or ((w <= y) <= z)):
                    print(x, y, z, w)
```
## Ответ: wxyz

# Задания 8 типа
## Задание 8 типа №10473
Шифр кодового замка представляет собой последовательность из пяти символов, каждый из которых является цифрой от 1 до 4. Сколько различных вариантов шифра можно задать, если известно, что цифра 1 встречается ровно два раза, а каждая из других допустимых цифр может встречаться в шифре любое количество раз или не встречаться совсем?

```
from itertools import product 
alphabet = '1234'
ap=[]
for i in product(alphabet, repeat=5):    
    if i.count('1') == 2:
        ap.append(i)
print(len(ap))
```
## Ответ: 270

## Задание 8 типа №58235
Сколько существует различных трёхзначных чисел, записанных в четверичной системе счисления, в записи которых сумма первой и последней цифры строго больше цифры стоящей по середине?

```
from itertools import product 
alphabet = '0123'
ap=[]
for i in product(alphabet, repeat=3):    
    if (i[0] != '0') and (int(i[0]) + int(i[2]) > int(i[1])):
        ap.append(i)
print(len(ap))
```
## Ответ: 38

## Задание 8 типа №58237
Сколько существует различных четырёхзначных чисел, записанных в семеричной системе счисления, в записи которых цифры следуют слева направо в строго убывающем порядке?

```
from itertools import product 
alphabet = '0123456'
ap=[]
for i in product(alphabet, repeat=4):    
    if i[0] > i[1] > i[2] > i[3]:
        ap.append(i)
print(len(ap))
```
## Ответ: 35
